"""
1. Написать любую детерменированную функцию (Детерменированная функция = функция, которая возвращает одно и тоже вне
зависимости от парамеметров)
"""

def det_func():
    print('Hello world!')
    return 'Done!'

det_func()